HalloYang06/PSOC_E84_robot/applications/ifx_deepcraft/include/ifx_pre_post_process.h
/******************************************************************************
* File Name: ifx_pre_post_process.h
*
* Description: This file contains public interface for Infineon pre and
*              post process
*
* Related Document: See README.md
*
*******************************************************************************
* (c) 2021, Infineon Technologies Company. All rights reserved.
*******************************************************************************
* This software, including source code, documentation and related materials
* ("Software"), is owned by Infineon Technologies Company (Infineon) or one of its
* subsidiaries and is protected by and subject to worldwide patent
* protection (United States and foreign), United States copyright laws and
* international treaty provisions. Therefore, you may use this Software only
* as provided in the license agreement accompanying the software package from
* which you obtained this Software ("EULA").
*
* If no EULA applies, Infineon hereby grants you a personal, non-exclusive,
* non-transferable license to copy, modify, and compile the Software source
* code solely for use in connection with Infineon's integrated circuit products.
* Any reproduction, modification, translation, compilation, or representation
* of this Software except as specified above is prohibited without the express
* written permission of Infineon.
*
* Disclaimer: THIS SOFTWARE IS PROVIDED AS-IS, WITH NO WARRANTY OF ANY KIND,
* EXPRESS OR IMPLIED, INCLUDING, BUT NOT LIMITED TO, NONINFRINGEMENT, IMPLIED
* WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE. Infineon
* reserves the right to make changes to the Software without notice. Infineon
* does not assume any liability arising out of the application or use of the
* Software or any product or circuit described in the Software. Infineon does
* not authorize its products for use in any products where a malfunction or
* failure of the Infineon product may reasonably be expected to result in
* significant property damage, injury or death ("High Risk Product"). By
* including Infineon's product in a High Risk Product, the manufacturer of such
* system or application assumes all risk of such use and in doing so agrees to
* indemnify Infineon against all liability.
*******************************************************************************/

/*******************************************************************************
* Include guard
*******************************************************************************/
#ifndef __IFX_PRE_POST_PROCESS_H
#define __IFX_PRE_POST_PROCESS_H

#if defined(__cplusplus)
extern "C" {
#endif

/*******************************************************************************
* Include header file
*******************************************************************************/
#include <stdint.h>
#include <stdbool.h>
#include "ifx_sp_common.h"
/*******************************************************************************
* Compile-time flags
*******************************************************************************/


/*******************************************************************************
* Structures and enumerations
*******************************************************************************/

/** Defines ifx pre and post process IP components */
typedef enum
{
    IFX_PRE_PROCESS_IP_COMPONENT_SOD = IFX_PRE_POST_IP_COMPONENT_START_ID,  /* Infineon LPWWD SOD IP component */
    IFX_PRE_PROCESS_IP_COMPONENT_HPF,
    IFX_PRE_PROCESS_IP_COMPONENT_DENOISE,
    IFX_PRE_PROCESS_IP_COMPONENT_AMPREDICT,
    IFX_PRE_PROCESS_IP_COMPONENT_ASRC_LPF,
    IFX_PRE_PROCESS_IP_COMPONENT_LOG_MEL,
    IFX_PRE_PROCESS_IP_COMPONENT_MFCC,
    IFX_POST_PROCESS_IP_COMPONENT_DFWWD,
    IFX_POST_PROCESS_IP_COMPONENT_HMMS,
    IFX_POST_PROCESS_IP_COMPONENT_DFCMD,
    IFX_POST_PROCESS_IP_COMPONENT_AGC,
    IFX_POST_PROCESS_IP_COMPONENT_LPWWD,
    IFX_POST_PROCESS_IP_COMPONENT_MAX_COUNT
} ifx_pre_post_ip_component_config_t;

typedef enum agc_mode_t {
    SPEECH_MODE, MUSIC_MODE
}agc_mode;

#define AGC_MAX_TARGET_LEVEL_DB  10
#define AGC_MIN_TARGET_LEVEL_DB  -30

/**
 * Shared control/model structure
 */
typedef struct ifx_stc_pre_post_process_info_t
{
    /*@{*/
    int component_id;           /**< pre or post process compnent ID */
    int sampling_rate;          /**< audio and voice data sampling rate in Hz */
    int input_frame_size;       /**< input data frame size in samples */
    int frame_shift;            /**< input data frame shift in samples */
    int fft_block_size;         /**< fft block size in samples */
    int output_size;            /**< spreech enhancement application output size in its data type */
    mem_info_t memory;          /**< memory structure contains info required for process */
    int libsp_version;          /**< version number of Infineon pre and post process IP library */
    int configurator_version;   /**< Configurator version number */
    /*@}*/
} ifx_stc_pre_post_process_info_t;


/******************************************************************************
* Function prototype
******************************************************************************/
/**
 * \addtogroup API
 * @{
 */

/**
 * \brief : ifx_pre_post_process_parse() is the API function to parse basic info and estimate memory
 *          needed by ip_id component block. This only needed for parse confiurator generated parameter file.
 *
 *
 * \param[in]  ip_prms_buffer   : Configuration parameter buffer which has component ID and related parameters
 *                              : For SOD, it contains SOD configuration parameter: [configuration version, sampling rate(Hz),
 *                              : input frame size (samples), SOD component ID, number of following parameters,
 *                              : GapSetting (0,100,200,300,400,500,1000)ms, SensLevel (0-32767)]
 *                              : For preprocess, it contains preprocess configuration parameter: [configuration version,
 *                              : sampling rate(Hz), input frame size (samples), compenent ID, number of following parameters,
 *                              : frame shift (samples), mel banks, dct coefficients (set to 0 for LOG MEL)]
 *                              : For post process, it contains post process configuration parameters: [configuration version,
 *                              : sampling rate(Hz), input frame size (samples), compenent ID, number of following parameters,
 *                              : frame rate per second, lookback buffer length in second in Q12, NN stacked frame delay in second
 *                              : in Q12, detection threshold (lower 16bit is set (i.e. update) flag, upper 16bit is detection 
 *                              : threshold (range -10 to 10); higher the threshold, the less detections and less fasle alarms, 
 *                              : lower threshold should cause more detections, more fasle alarms)]
 * \param[out] ip_infoPt        : Pointer to ifx_stc_pre_post_process_info_t structure
 * \return                      : Return 0 when success, otherwise return error code
 *                                INVALID_ARGUMENT if input or output argument is invalid
 *                                or error code from specific infineon pre and post process component.
 *                                Please note error code is 8bit LSB, line number where the error happened in
 *                                code is in 16bit MSB, and its IP component index if applicable will be at
 *                                bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_pre_post_process_parse(int32_t * ip_prms_buffer, ifx_stc_pre_post_process_info_t *ip_infoPt);

/**
 * \brief : ifx_pre_post_process_init() is the API function to initilize component container based on component ID.
 *
 *
 * \param[out]  container       : Pointer to component ID's container that contains state memory and parameters
 * \param[out]  ip_infoPt       : Pointer to component ID's ifx_stc_pre_post_process_info_t
 * \param[in]   prms_buffer     : Manually generated parameter buffer which has component id and related parameters
 *                              : For SOD, it contains SOD configuration parameter: [configuration version, sampling rate(Hz),
 *                              : input frame size (samples), SOD component ID, number of following parameters,
 *                              : GapSetting (0,100,200,300,400,500,1000)ms, SensLevel (0-32767)]
 *                              : For preprocess, it contains preprocess configuration parameter: [configuration version,
 *                              : sampling rate(Hz), input frame size (samples), compenent ID, number of following parameters,
 *                              : frame shift (samples), mel banks, dct coefficients (set to 0 for LOG MEL)]
 *                              : For post process, it contains post process configuration parameters: [configuration version,
 *                              : sampling rate(Hz), input frame size (samples), compenent ID, number of following parameters,
 *                              : frame rate per second, lookback buffer length in second in Q12, NN stacked frame delay in second
 *                              : in Q12, detection threshold (lower 16bit is set (i.e. update) flag, upper 16bit is detection
 *                              : threshold (range -10 to 10); higher the threshold, the less detections and less fasle alarms,
 *                              : lower threshold should cause more detections, more fasle alarms)]
 * \return                      : Return 0 when success, otherwise return error code
 *                                INVALID_ARGUMENT if input or output argument is invalid
 *                                or error code from specific infineon pre and post process component.
 *                                Please note error code is 8bit LSB, line number where the error happened in
 *                                code is in 16bit MSB, and its IP component index if applicable will be at
 *                                bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_pre_post_process_init(int32_t * prms_buffer, void **container, ifx_stc_pre_post_process_info_t *ip_infoPt);

/**
 * \brief : ifx_time_pre_process() is the API function to pre process in time domain given user's selected method.
 *
 *
 * \param[in]  preprocess_container : Pointer to preprocess container that contains state memory and parameters
 * \param[in]  component_id         : Infineon pre process component ID
 * \param[in]  input1               : Pointer to 1st input buffer (mic1 samples)
 * \param[in]  input2               : Pointer to 2nd input buffer (mic2 samples)
 * \param[out] output1              : pointer to buffer where preprocessed time domain output of one frame 1st input
 * \param[out] output2              : pointer to buffer where preprocessed time domain output of one frame 2nd input
 * \return                          : Return 0 when success, otherwise return error code
 *                                    INVALID_ARGUMENT if input or output argument is invalid
 *                                    or error code from specific infineon preprocess component.
 *                                    Please note error code is 8bit LSB, line number where the error happened in
 *                                    code is in 16bit MSB, and its IP component index if applicable will be at
 *                                    bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_time_pre_process(IFX_SP_DATA_TYPE_T *input1, IFX_SP_DATA_TYPE_T* input2, void *preprocess_container, int32_t component_id, IFX_SP_DATA_TYPE_T *output1, IFX_SP_DATA_TYPE_T* output2);

/**
 * \brief : ifx_agc_set_target_level_and_mode() is the API function to set AGC Target level in db and AGC mode by user.
 *
 *
 * \param[in/out]  agc_container    : Pointer to AGC container that contains state memory and parameters
 * \param[in] agcTargetLevelDB      : AGC Target level in dB
 * \param[in] agcMode               : AGC mode defined by enumerations of agc_mode
 * \return                          : Return 0 when success, otherwise return error code
 *                                    INVALID_ARGUMENT if input or output argument is invalid
 *                                    or error code from specific infineon preprocess component.
 *                                    Please note error code is 8bit LSB, line number where the error happened in
 *                                    code is in 16bit MSB, and its IP component index if applicable will be at
 *                                    bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_agc_set_target_level_and_mode(void* agcTopPt, float agcTargetLevelDB, int agcMode);

/**
 * \brief : ifx_time_post_process() is the API function to post process in time domain given user's selected method.
 *
 *
 * \param[in]  postprocess_container: Pointer to postprocess container that contains state memory and parameters
 * \param[in]  component_id         : Infineon post process component ID (current only support IFX_POST_PROCESS_IP_COMPONENT_AGC)
 * \param[in]  input                : Pointer to input buffer
 * \param[out] output               : pointer to buffer where postprocessed time domain output of one frame
 * \return                          : Return 0 when success, otherwise return error code
 *                                    INVALID_ARGUMENT if input or output argument is invalid
 *                                    or error code from specific infineon preprocess component.
 *                                    Please note error code is 8bit LSB, line number where the error happened in
 *                                    code is in 16bit MSB, and its IP component index if applicable will be at
 *                                    bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_time_post_process(IFX_SP_DATA_TYPE_T* input, void* postprocess_container, int32_t component_id, IFX_SP_DATA_TYPE_T* output);

/**
 * \brief : ifx_sod_process() is the API function to do SOD process.
 *
 *
 * \param[out] vad               : pointer to SOD detection is written, 1=SOD detected, 0=NO SOD detected
 * \param[in/out]  sod_container : Pointer to SOD container that contains state memory and its params
 * \param[in]  in                : Pointer to PCM samples input
 * \return                       : Return 0 when success, otherwise return error code
 *                                 IFX_SP_ENH_ERR_INVALID_ARGUMENT if input or output argument is invalid
 *                                 or error code from specific ifx audio & voice enhancement proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_sod_process(IFX_SP_DATA_TYPE_T* in, void* sod_container, bool* vad);

/**
 * \brief : ifx_spectrogram_transfer() is the API function to do spectrogram transformation given user's method.
 *
 *
 * \param[out] fe_out               : pointer to buffer where feature for one frame is kept
 * \param[out] out_q                : pointer to output fixed-point Q value
 * \param[in]  preprocess_container : Pointer to preprocess container that contains state memory and parameters
 * \param[in]  input                : Pointer to input samples
 * \return                          : Return 0 when success, otherwise return error code
 *                                    INVALID_ARGUMENT if input or output argument is invalid
 *                                    or error code from specific infineon preprocess component.
 *                                    Please note error code is 8bit LSB, line number where the error happened in
 *                                    code is in 16bit MSB, and its IP component index if applicable will be at
 *                                    bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_spectrogram_transfer(IFX_SP_DATA_TYPE_T *input, void *spectrogram_container, IFX_FE_DATA_TYPE_T *fe_out, int32_t *out_q);

/**
 * \brief : ifx_post_process() is the API function to use output of the Neural Network and use post process to declare WWD. 
 *
 *
 * \param[in]  postprocess_container    : Pointer to postprocess container that contains state memory and parameters
 * \param[in]  component_id             : Infineon pre and post process component ID
 * \param[in]  in_probs                 : pointer for the buffer containing output probabilities from classifier in 
 *                                        the order of token 1, token 2, garbage, noise.
 * \param[out] detection                : WUP detection output; 0 means monitoring, 1 means detected, negtive means rejected.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_post_process(IFX_PPINPUT_DATA_TYPE_T *in_probs, void *postprocess_container, int32_t component_id, int32_t *detection);

/**
 * \brief : ifx_class_convertion_init() is the API function to process inference classification id_string and initilize output_id_array
 *          before call ifx_class_convertion_for_pp() function.
 *
 * \param[in]  id_string                : Pointer to string decribing the inference classification indetifications which must contain
 *                                        "WWDtoken0", "WWDtoken1", and "noise". Each ID should only occur once, and its position in the
 *                                        string corresponds to its inference classification position. Please notice that "garbage" is a
 *                                        optional ID since initilization process will treat other than above IDs as garbage. Each ID shall
 *                                        be seperated by ",".
 *                                        Note the inference classification IDs order is decided by the NN model during NN model training.
 *                                        For example, "WWDtoken0,WWDtoken1,WWDtoken2,WWDtoken3,garbage,noise" is a valid id_string for 4 token WW model.
 *                                        The number of classes is 6 with 4 token WW model. For 2 token KW model, the number of class is 4.
 *                                        For 2 token 2 WW model, the number of class is 6, and 2 WW model only support 2 token per WW.
 *                                        The last two are always garbage and noise.
 * \param[in]  size                     : Inference output classification size
 * \param[in]  ww_tokens                : Number of tokens in wake word
 * \param[out] output_id_array          : Pointer to the output buffer containing inference classification indetification number.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_class_convertion_init(const char* id_string, int* output_id_array, int size, int ww_tokens);

/**
 * \brief : ifx_class_convertion_for_pp() is the API function to convert multi-keyword inference output to one keyword post-process
 *          classification before using post process to declare WWD.
 *
 * \param[in]  input_score              : Pointer to two keyword inference output buffer
 * \param[in]  data_type                : Infineon inference output (input_score) data type, and it is also output_score data type.
 * \param[in]  id_array                 : Pointer to the buffer containing inference classification indetification number
 * \param[in]  size                     : Inference output classification size
 * \param[in]  ww_tokens                : Number of tokens in wake word
 * \param[out] output_score             : Corresponding one key word inference output buffer pointer.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_class_convertion_for_pp(void* input_score, int data_type, void* output_score, int* id_array, int size, int ww_tokens);

/**
 * \brief : ifx_pre_post_process_mode_control() is the API function to control Infineon pre and post process compenent's mode.
 * This API is used to control Infineon pre and post process IP component's mode. This API can be called after initilization.
 * If the Infineon pre and post process IP component is not configured as valid. This API will do nothing.
 *
 * \param[out]  container       : Pointer to Infineon pre and post process model data container pointer
 * \param[in]   component_id    : Infineon pre and post process component ID
 * \param[in]   enable          : Enable or disable component specified by component_id
 * \param[in]   reset           : If value = true, reset component_id's state. If value = false, no change on component's state.
 *
 * \return                      : Return 0 when success, otherwise return error code
 *                                Return INVALID_ARGUMENT if input argument is invalid.
 *                                or error code from specific infineon post process component.
 *                                Please note error code is 8bit LSB, line number where the error happened in
 *                                code is in 16bit MSB, and its IP component index if applicable will be at
 *                                bit 8 to 15 in the combined 32bit return value.
*/
int32_t ifx_pre_post_process_mode_control(void* container, int32_t component_id, bool enable, bool reset);

