HalloYang06/PSOC_E84_robot/applications/ifx_deepcraft/include/ifx_pre_post_process.h
/**
 * \brief : ifx_pre_post_process_status() is the API function to query Infineon pre and post process compenent's status.
 * This API can be called after initilization.
 * If the Infineon pre and post process IP component is not configured as valid. This API will return status as disabled.
 *
 * \param[out]  container       : Pointer to Infineon pre and post process model data container pointer
 * \param[in]   component_id    : ifx audio & voice enhancement process component ID
 *
 * \return                      : Return 0 means disabled
 *                                Return 1 means enabled
*/
int32_t ifx_pre_post_process_status(void* container, int32_t component_id);

/**
 * \brief : Initialize pre/post process profile configuration.
 *
 * This API is used to setup pre/post process profile configuration and specify the callback function to handle
 * the profile log. If no callback function is specified, the profile log will be printed out on console.
 *
 * \param[in]  modelPt         : Pointer to ifx pre/post process data container pointer
 * \param[in]  ip_id           : Pre/post process component ID number.
 * \param[in]  enable          : Profile setting enable (true) or disable (false).
 * \param[in]  cb_func         : Callback function to handle the profile result.
 * \param[in]  cb_arg          : Callback function argument
 *
 * \return                     : Return 0 when success, otherwise return error code
 *                               Return IFX_SP_ENH_ERR_INVALID_ARGUMENT if input parameter is invalid.
*/
int32_t ifx_pre_post_profile_init(void* modelPt, int32_t ip_id, uint8_t enable, ifx_sp_profile_cb_fun cb_func, void* cb_arg);

/**
 * \brief : Update pre/post process profile configuration.
 *
 * This API is used to update pre/post process profile configuration.
 *
 * \param[in]  modelPt         : Pointer to ifx pre/post process data container pointer
 * \param[in]  ip_id           : Pre/post process component ID number.
 * \param[in]  enable          : Profile setting enable (true) or disable (false).
 *
 * \return                     : Return 0 when success, otherwise return error code
 *                               Return IFX_SP_ENH_ERR_INVALID_ARGUMENT if input parameter is invalid.
*/
int32_t ifx_pre_post_profile_control(void* modelPt, int32_t ip_id, bool enable);

/**
 * \brief : Print pre/post process profile log.
 *
 *
 * \param[in]  lPt             : Pointer to profile data container pointer
 * \param[in]  ip_id           : Pre/post process component ID number.
 * \return                     : Return 0 when success, otherwise return error code
 *                               Return IFX_SP_ENH_ERR_INVALID_ARGUMENT if input parameter is invalid.
*/
int32_t ifx_pre_post_profile_print(void* lPt, int32_t ip_id);

/**
 * \brief : itsi_feature_process_frame() is the API function to do itsi feature extraction.
 *
 *
 * \param[out] fe_out               : pointer to buffer where feature for one frame is kept
 * \param[in]  featureContainerPt   : Pointer to itsi feature preprocess container that contains state memory and parameters
 * \param[in]  input                : Pointer to input samples
 * \return                          : Return 0 when success, otherwise return error code
 *                                    INVALID_ARGUMENT if input or output argument is invalid
 *                                    or error code from specific infineon preprocess component.
 *                                    Please note error code is 8bit LSB, line number where the error happened in
 *                                    code is in 16bit MSB, and its IP component index if applicable will be at
 *                                    bit 8 to 15 in the combined 32bit return value.
*/
int32_t itsi_feature_process_frame(float* input, void* featureContainerPt, float* fe_out);

/**
 * \brief : itsi_feature_init(void** feature_container, mem_info_t* mem_infoPt) is the API function to init itsi feature process
 *
 *
 * \param[in]  feature_container : Pointer to itsi feature container that contains state memory and parameters
 * \param[in]   mem_infoPt       : Pointer to mem_info_t data structure contains itsi feature persistent and scratch memry infomation
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t itsi_feature_init(void** feature_container, mem_info_t* mem_infoPt);

/**
 * \brief : ifx_itsi_feature_reset(void* feature_container) is the API function to reset itsi feature internal memory.
 *
 *
 * \param[in]  feature_container : Pointer to itsi feature container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_itsi_feature_reset(void* feature_container);

/**
 * \brief : itsi_feature_deinit(void* feature_container) is the API function to release itsi feature internal memory
 *
 *
 * \param[in]  feature_container : Pointer to itsi feature container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t itsi_feature_deinit(void* featureContainerPt);

/**
 * \brief : ifx_afe_hpf_reset(void* hpf_container) is the API function to reset itsi afe hpf internal memory.
 *
 *
 * \param[in]  hpf_container     : Pointer to itsi afe hpf container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_afe_hpf_reset(void* hpf_container);

/**
 * \brief : itsi_dfwwd_init() is the API function to init data free wake word detection process.
 *
 * \param[in]   dfwwModelPrmPt   : Pointer to dfwwd model that contains dfww model parameters
 * \param[out]  container        : Pointer to dfwwd container that contains state memory and parameters
 * \param[in]   mem_infoPt       : Pointer to mem_info_t data structure contains dfwwd persistent and scratch memry infomation
 * \param[in]   timeout          : dfwwd tunable parameter to set maximum time in milisecond between SOD and WW
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t itsi_dfwwd_init(const char* dfwwModelPrmPt, void** container, mem_info_t* mem_infoPt, uint32_t timeout);

/**
 * \brief : ifx_dfww_state_reset() is the API function to reset the entire state of data free wake word detection process.
 *
 * \param[in/out]  container     : Pointer to dfwwd container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_dfww_state_reset(void* StrucPt);

/**
 * \brief : ifx_reset_dfww() is the API function to reset data free wake word detection process.
 *
 * \param[win/out]  container    : Pointer to dfwwd container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_reset_dfww(void* StrucPt);

/**
 * \brief : ifx_wwd() is the API function to run wake word detection process.
 *
 * \param[in/out]  container     : Pointer to dfwwd container that contains state memory and parameters
 * \param[in]  input             : Pointer to softmax score input
 * \param[out] decison           : pointer to Wake Word (WW) detection is written, 1=WW detected, -1=WW rejected, 0=indecision
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_wwd(void* StrucPt, float* input, int32_t* decision);

/**
 * \brief : itsi_dfcmd_init() is the API function to init data free command detection process.
 *
 * \param[in]   dfcmdModelPrmPt  : Pointer to dfcmd model that contains dfcmd model parameters
 * \param[in]   dfnmbModelPrmPt  : Pointer to dfnmb model that contains dfnmb model parameters
 * \param[out]  container        : Pointer to dfcmd container that contains state memory and parameters
 * \param[in]   mem_infoPt       : Pointer to mem_info_t data structure contains dfcmd persistent and scratch memry infomation
 * \param[in]   gap              : dfcmd tunable parameter to set maximum time in milisecond allowed between the end of the WW
 *                                 and the beginning of the commands
 * \param[in]   adj_level        : dfcmd tunable parameter to decrease or increase maximum CMD duration until timeout 
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t itsi_dfcmd_init(const char* dfcmdModelPrmPt, const char* dfnmbModelPrmPt, void** container, mem_info_t* mem_infoPt, uint32_t gap, int32_t adj_level);

/**
 * \brief : ifx_dfcmd_state_reset() is the API function to reset the entire state of data free command detection process.
 *
 * \param[in/out]  container     : Pointer to dfcmd container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_dfcmd_state_reset(void* DFcmdStrucPt);

/**
 * \brief : ifx_reset_dfcmd() is the API function to reset data free command detection process.
 *
 * \param[in/out]  container     : Pointer to dfcmd container that contains state memory and parameters
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_reset_dfcmd(void* DFcmdStrucPt, int PrevCmd);

/**
 * \brief : ifx_cmd() is the API function to run command detection process.
 *
 * \param[in/out] DFwwStrucPt    : Pointer to dfwwd container that contains state memory and parameters
 * \param[in/out] DFcmdStrucPt   : Pointer to dfcmd container that contains state memory and parameters
 * \param[in]  input             : Pointer to softmax score input
 * \param[out] decison           : pointer to command detection is written, 1=CMD detected, -1=CMD rejected, 0=indecision
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_dfcmd(void* DFwwStrucPt, void* DFcmdStrucPt, float* input, int32_t* decison);

/**
 * \brief : itsi_get_ww_llscore() is the API function to get itsi WW log-likelihood score.
 *
 * \param[in] StrucPt            : Pointer to dfww data structure.
 * \param[out] *ww_llscore       : Return WW log-likelihood score.
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_get_ww_llscore(void* StrucPt, float* ww_llscore);

/**
 * \brief : itsi_get_cmd_llscore() is the API function to get itsi cmd log-likelihood score.
 *
 * \param[in] StrucPt            : Pointer to dfcmd data structure.
 * \param[out] *cmd_llscore      : Return cmd log-likelihood score.
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_get_cmd_llscore(void* StrucPt, float* cmd_llscore);

/**
 * \brief : itsi_get_nmb_llscore() is the API function to get itsi number log-likelihood score.
 *
 * \param[in] StrucPt            : Pointer to dfcmd data structure.
 * \param[out] *nmb_llscore      : Return number log-likelihood score.
 * \return                       : Return 0 when success, otherwise return error code from specific ifx itsi proces module.
 *                                 Please note error code is 8bit LSB, line number where the error happened in
 *                                 code is in 16bit MSB, and its IP component index if applicable will be at
 *                                 bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_get_nmb_llscore(void* StrucPt, float* nmb_llscore);

/**
 * \brief : ifx_lpwwd_post_process() is the API function to use output of the Neural Network and use lpwwd post process to declare WWD. 
 *
 *
 * \param[in]  postprocess_container    : Pointer to lpwwd postprocess container that contains state memory and parameters
 * \param[in]  in_probs                 : pointer for the buffer containing output probabilities from classifier in 
 *                                        the order of token 1, token 2, garbage, noise.
 * \param[out] detection                : Detection output; 0 means monitoring, positive means detected, negative means rejected.
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_lpwwd_post_process(void* postprocess_container, IFX_PPINPUT_DATA_TYPE_T* in_probs, int32_t* detection);


/**
 * \brief : ifx_lpwwd_post_process_reset() is the API function to reset lpwwd post process memory and state. 
 *
 *
 * \param[in]  postprocess_container    : Pointer to lpwwd postprocess container that contains state memory and parameters
 * \return                              : Return 0 when success, otherwise return error code
 *                                        INVALID_ARGUMENT if input or output argument is invalid
 *                                        or error code from specific infineon post process component.
 *                                        Please note error code is 8bit LSB, line number where the error happened in
 *                                        code is in 16bit MSB, and its IP component index if applicable will be at
 *                                        bit 8 to 15 in the combined 32bit return value.
*/
uint32_t ifx_lpwwd_post_process_reset(void* postprocess_container);

#if defined(__cplusplus)
}
#endif

#endif /*__IFX_PRE_POST_PROCESS_H */

/* [] END OF FILE */
